package SBER.SGU.q2001;

import java.util.Scanner;
/*
Заданы a и b. Выведите a+b.
Входные данные
В единственной строке входных данных заданы целочисленные a и b (1 ≤ a,b ≤ 1000).

Выходные данные
Выведите a+b.

 */

public class Solution {
    public static void main(String[] args) {
        Scanner in = new Scanner(System.in);
        System.out.println(in.nextInt() + in.nextInt());

    }
}